Repository: jrr6/Caffeinator
Catalog: Caffeinator/*.lproj/Localizable.strings
Languages: es

# AD.license-error
source: There was an error parsing the License text. Please report this so it can be fixed.
es: Un error ocurrió durante el análisis del texto de Licencia. Por favor presenta un informe sobre este error.

# AD.start-caffeinator
source: Start Caffeinator
es: Iniciar Caffeinator

# AD.stop-caffeinator
source: Stop Caffeinator
es: Terminar Caffeinator

# AD.process-menu-item
source: Caffeinate a Process…
es: Usar Caffeinate con un proceso…

# AD.pref-tag-err-title
source: Unknown Preference Tag
es: Etiqueta de preferencia desconocida

# AD.pref-tag-err-msg
source: An attempt was made to set a preference by an unrecognized sender. This error should be reported.
es: Un remitente desconocido trató de ajustar una preferencia. Por favor presenta un informe sobre este error.

# AD.process-dialog-window-title
source: Caffeinate a Process
es: Caffeinate un proceso

# AD.process-dialog-title
source: Select a Process
es: Escoge un proceso

# AD.process-dialog-msg
source: Enter the PID of the process you would like to Caffeinate. This PID can be found in Activity Monitor:
es: Introduce el PID del proceso con que deseas usar Caffeinate. Este PID se puede encontrar en Activity Monitor:

# AD.caffeinating-app-label
source: Caffeinating %@
es: Caffeinate está activo en %@

# AD.illegal-process-title
source: Illegal Input
es: Entrada ilegal

# AD.illegal-process-msg
source: You must enter the PID of the process you wish to Caffeinate.
es: Hay que introducir el PID del proceso con que deseas usar Caffeinate.

# AD.minutes-with-space
source: minutes
es: minutos

# AD.hours-with-space
source: hours
es: horas

# AD.illegal-time-title
source: Illegal Time Value
es: Entrada ilegal

# AD.illegal-time-msg
source: The time value must be a valid number greater than or equal to 1 second.
es: La entrada de tiempo debe ser un número mayor o igual que 1 segundo.

# AD.execution-prompt-title
source: Confirm Caffeination
es: Confirmar Caffeination

# AD.execution-prompt-msg
source: The following command will be run: %@
es: El siguiente comando se ejecutará: %@

# AD.execution-prompt-cancel-text
source: Cancel
es: Cancelar

# AD.caffeinate-missing-dialog-title
source: Could Not Find Caffeinate
es: Caffeinate no se encontró

# AD.caffeinate-missing-dialog-msg
source: Your system does not appear to have caffeinate installed. Ensure that your disk permissions are properly set; you may also need to re-install macOS.
es: Parece que caffeinate no está instalado en tu ordenador. Asegúrate de que los permisos del disco sean correctos; posiblemente necesites reinstalar macOS.

# KM.kill-caffeinate-prompt-title
source: Existing caffeinate Process Found
es: Procesos de caffeinate existentes se encontraron

# KM.kill-caffeinate-prompt-msg
source: One or more caffeinate processes are already running on your computer. These processes may override Caffeinator and disrupt its functionality. Caffeinator only works when no other caffeinate processes are active. Would you like Caffeinator to end these caffeinate processes for you?
es: Uno o más procesos de caffeinate ya están ejecutando en tu ordenador. Esto haya ocurrido porque Caffeinator no fue cerrado correctamente. Caffeinator sólo funciona cuando no hay otros procesos de caffeinate activos. ¿Deseas que Caffeinator termine estos otros procesos de caffeinate?

# KM.no-caffeinate-process-title
source: No caffeinate Process Found
es: El proceso caffeinate no se encontró

# KM.no-caffeinate-process-msg
source: An attempt was made to kill a background caffeinate process, but no such process exists. This error should be reported unless you manually killed the caffeinate process.
es: Se intentó terminar un proceso caffeinate del fondo, pero el proceso no existe. Por favor presenta un informe sobre este error a menos que manualmente terminaste el proceso.

# KM.unknown-killall-error-title
source: Unknown killall Error
es: Error desconocido de killall

# KM.unknown-killall-error-msg
source: An unknown error occurred when calling the killall command. This error should be reported.
es: Un error desconocido ocurrió cuando el programa killall fue invocado. Por favor presenta un informe sobre este error.

# N.cancel-text
source: Cancel
es: Cancelar

# N.value-dialog-window-title
source: Value Input
es: Entrada de valor

# N.value-dialog-title
source: Please Enter a Value
es: Introduce un valor

# N.value-dialog-msg
source: Please enter the value for the %@ parameter below:
es: Introduce un valor para la opción "%@" abajo:

# U.auto-update-disabled-title
source: Auto-Update Disabled
es: La actualización automática está apagada

# U.auto-update-disabled-msg
source: The Caffeinator auto-updater has been disabled. Any updates to the application must be applied manually. To re-enable automatic updates, please copy and paste the following command into Terminal, press Enter, and restart Caffeinator: %@
es: La actualización automática de Caffeinator ha sido apagada. Hay que instalar actualizaciones manualmente. Para volver a habilitar las actualizaciones automáticas, copia y pega el siguiente comando en Terminal, pulsa Enter y reinicia Caffeinator: %@

# U.no-update-data-title
source: No Update Data Received
es: Datos de actualización no fueron recibidos

# U.no-update-data-msg
source: The GitHub API returned no data. This error should be reported.
es: El API de GitHub no devolvió ningunos datos. Por favor presenta un informe sobre este error.

# U.improper-json-title
source: Improperly Formatted JSON
es: JSON erróneo

# U.improper-json-msg
source: The JSON data returned by the update server was not in the correct format. This error should be reported.
es: Los datos de JSON devolvidos por el servidor de actualización no fue del formato correcto. Por favor presenta un informe sobre este error.

# U.serialization-failure-title
source: Could Not Serialize Update Data
es: Datos de actualización no fueron serializados

# U.serialization-failure-msg
source: The data returned by the GitHub API was not in a valid JSON format, or JSONSerialization failed internally. This error should be reported.
es: Los datos de JSON devolvidos por el API de GitHub no fueron de formato correcto, o JSONSerialization falló internalmente. Por favor presenta un informe sobre este error.

# U.version-parse-failure-title
source: Failed to Parse Update Information
es: Analisis de actualización falló

# U.version-parse-failure-msg
source: The data necessary for checking the latest version of Caffeinator could not be found. This error should be reported.
es: Los datos necesarios para buscar actualizaciones de Caffeinator no se encontraron. Por favor presenta un informe sobre este error.

# U.download-parse-failure-title
source: Failed to Parse Download Information
es: Descarga de datos de actualización falló

# U.download-parse-failure-msg
source: While update version data was able to be parsed, download asset data could not. This error should be reported.
es: Los datos de la versión de actualización fueron analizados, pero el analisis de los datos sobre recursos de actualización no podía ser analizado. Por favor presenta un informe sobre este error.

# U.caffeinator-update-title
source: Caffeinator Update
es: Actualización de Caffeinator

# U.no-update-title
source: No Updates Available
es: No hay actualizaciones disponibles

# U.no-update-msg
source: You're running the latest version of Caffeinator.
es: Ya tienes la última versión de Caffeinator.

# U.url-open-failure-title
source: Error Opening URL
es: El URL no abrió

# U.url-open-failure-msg
source: Could not open the URL for the update download. You can manually download the update by going to https://aaplmath.github.io/Caffeinator and clicking the Download button. This error should be reported.
es: El URL para la descarga de actualización no abrió. Puedes descargar la actualización manualmente en https://aaplmath.github.io/Caffeinator por hacer clic en el botón "Descargar Caffeinator". Por favor presenta un informe sobre este error.
